## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/9674100430)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Create
  * github_actions_organization_variable.gcp_kyma_project_project_id
  * github_actions_organization_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider
  * github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Delete
  * github_actions_variable.gcp_kyma_project_project_id
  * github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider
  * github_actions_variable.image_builder_ado_pat_gcp_secret_name



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_organization_variable.gcp_kyma_project_project_id will be created
  + resource "github_actions_organization_variable" "gcp_kyma_project_project_id" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = "sap-kyma-prow"
      + variable_name = "GCP_KYMA_PROJECT_PROJECT_ID"
      + visibility    = "all"
    }

  # github_actions_organization_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be created
  + resource "github_actions_organization_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = "projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/providers/github-com-kyma-project"
      + variable_name = "GH_COM_KYMA_PROJECT_GCP_WORKLOAD_IDENTITY_FEDERATION_PROVIDER"
      + visibility    = "all"
    }

  # github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name will be created
  + resource "github_actions_organization_variable" "image_builder_ado_pat_gcp_secret_name" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = "image-builder-ado-pat"
      + variable_name = "IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME"
      + visibility    = "all"
    }

  # github_actions_variable.gcp_kyma_project_project_id will be destroyed
  # (because github_actions_variable.gcp_kyma_project_project_id is not in configuration)
  - resource "github_actions_variable" "gcp_kyma_project_project_id" {
      - created_at    = "2024-03-02 19:17:08 +0000 UTC" -> null
      - id            = "test-infra:GCP_KYMA_PROJECT_PROJECT_ID" -> null
      - repository    = "test-infra" -> null
      - updated_at    = "2024-03-02 19:17:08 +0000 UTC" -> null
      - value         = "sap-kyma-prow" -> null
      - variable_name = "GCP_KYMA_PROJECT_PROJECT_ID" -> null
    }

  # github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be destroyed
  # (because github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider is not in configuration)
  - resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      - created_at    = "2023-07-25 14:52:54 +0000 UTC" -> null
      - id            = "test-infra:GH_COM_KYMA_PROJECT_GCP_WORKLOAD_IDENTITY_FEDERATION_PROVIDER" -> null
      - repository    = "test-infra" -> null
      - updated_at    = "2023-07-25 14:52:54 +0000 UTC" -> null
      - value         = "projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/providers/github-com-kyma-project" -> null
      - variable_name = "GH_COM_KYMA_PROJECT_GCP_WORKLOAD_IDENTITY_FEDERATION_PROVIDER" -> null
    }

  # github_actions_variable.image_builder_ado_pat_gcp_secret_name will be destroyed
  # (because github_actions_variable.image_builder_ado_pat_gcp_secret_name is not in configuration)
  - resource "github_actions_variable" "image_builder_ado_pat_gcp_secret_name" {
      - created_at    = "2024-05-31 08:53:09 +0000 UTC" -> null
      - id            = "test-infra:IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME" -> null
      - repository    = "test-infra" -> null
      - updated_at    = "2024-05-31 08:53:09 +0000 UTC" -> null
      - value         = "image-builder-ado-pat" -> null
      - variable_name = "IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME" -> null
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11154,"Program":"tfcmt","SHA1":"9e94b0a5cd33f7a43ce2ab5a9ef7a938fa4d5dbb","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->